package com.example.Lotto_Project.Service.Interface;

import java.util.List;

import javax.servlet.http.HttpSession;

import com.example.Lotto_Project.Entity.T_01_0005;
import com.example.Lotto_Project.Vo.Req.Lotto_Req_1;
import com.example.Lotto_Project.Vo.Res.Lotto_Res_1;

public interface Lotto_Service_1 {
	// -----------------------------------------------
	// "新增"或"修改" - T_00_0001
	// public Lotto_Res_1 Create_Update__T_00_0001(Lotto_Req_1 req);
	// -----------------------------------------------
	// "新增"(C) - T_01_0004 ( 放在Create__T_01_0005裡面 )
	// public Lotto_Res_1 Create__T_01_0004(List<T_01_0005> list);
	// -----------------------------------------------
	// ==========================================================================
	// T_01_0001
	// -----------------------------------------------
	// "新增"(C) - T_01_0001
	public Lotto_Res_1 Create__T_01_0001(Lotto_Req_1 req);

	// -----------------------------------------------
	// "修改"(U) - T_01_0001
	public Lotto_Res_1 Update__T_01_0001(Lotto_Req_1 req);

	// -----------------------------------------------
	// "查詢"(R) - T_01_0001
	public Lotto_Res_1 Search__T_01_0001___1(Lotto_Req_1 req);

	// -----------------------------------------------
	// "刪除"(D) - T_01_0001
	public Lotto_Res_1 Delete__T_01_0001(Lotto_Req_1 req);

	// ==========================================================================
	// T_01_0002
	// -----------------------------------------------
	// "新增"(C) - T_01_0002
	public Lotto_Res_1 Create__T_01_0002(Lotto_Req_1 req);

	// -----------------------------------------------
	// "修改"(U) - T_01_0002
	public Lotto_Res_1 Update__T_01_0002(Lotto_Req_1 req);

	// -----------------------------------------------
	// "查詢"(R) - T_01_0002
	public Lotto_Res_1 Search__T_01_0002___1(Lotto_Req_1 req);

	// -----------------------------------------------
	// "刪除"(D) - T_01_0002
	public Lotto_Res_1 Delete__T_01_0002(Lotto_Req_1 req);

	// ==========================================================================
	// T_01_0003
	// -----------------------------------------------
	// "新增"(C) - T_01_0003
	public Lotto_Res_1 Create__T_01_0003(Lotto_Req_1 req);

	// -----------------------------------------------
	// "修改"(U) - T_01_0003
	public Lotto_Res_1 Update__T_01_0003(Lotto_Req_1 req);

	// -----------------------------------------------
	// "查詢"(R) - T_01_0003
	public Lotto_Res_1 Search__T_01_0003___1(Lotto_Req_1 req);

	// ==========================================================================
	// T_01_0005、T_01_0004
	// -----------------------------------------------
	// "新增"(C) - T_01_0005、T_01_0004 (排程) Ps. 開獎
	public Lotto_Res_1 Create__T_01_0005__T_01_0004();

	// ==========================================================================
	// T_01_0005
	// -----------------------------------------------
	// "查詢"(R) - T_01_0005
	public Lotto_Res_1 Search__T_01_0005___1(Lotto_Req_1 req);

	// ==========================================================================
	// T_01_0004
	// -----------------------------------------------
	// "查詢"(R) - T_01_0004
	public Lotto_Res_1 Search__T_01_0004___1(Lotto_Req_1 req);

	// ==========================================================================
	// T_03_0001
	// -----------------------------------------------
	// "新增"(C) - T_03_0001 Ps. 註冊
	public Lotto_Res_1 Create__T_03_0001(Lotto_Req_1 req);

	// -----------------------------------------------
	// "修改"(U) - T_03_0001
	public Lotto_Res_1 Update__T_03_0001(Lotto_Req_1 req);

	// -----------------------------------------------
	// "修改"(U) - T_03_0001 Ps. 修改密碼
	public Lotto_Res_1 Update__UserPassword(Lotto_Req_1 req, HttpSession httpSessions);

	public HttpSession send(HttpSession httpSession);

	// -----------------------------------------------
	// "登入"(R) - T_03_0001
	public Lotto_Res_1 Login(Lotto_Req_1 req);
}
